app/controllers/pages_controller.rb

  def show
    #Finds the detailed view for a single page
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def new
    #Instantiates a new page with defaults from our database
    @page = Page.new(:name => "New Page")
    @page_count = Page.count + 1
---
SELECT COUNT(*) FROM `pages`

  def create
    #Instantiates a new page with the params filled out on the form
    @page = Page.new(page_params)
    if @page.save
---
INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (4, 'Page Two', 'pagetwo', 2, 1, '2017-07-30 18:35:03', '2017-07-30 18:35:03')

  def edit
    #Find a the page in the database and display information aboout it
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def delete
    #Finds a records so we confirm that the user does want to destroy it
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 2