app/controllers/sections_controller.rb

SELECT COUNT(*) FROM `sections`
---
  def new
    @section = Section.new
    @section_count = Section.count + 1

INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (1, 'SectionTwo', 2, 1, 'Test', 'This is a test section belonging to page one, hopefully it works', '2017-07-30 18:38:46', '2017-07-30 18:38:46')
---
  def create
    @section = Section.new(section_params)
    if @section.save

DELETE FROM `sections` WHERE `sections`.`id` = 2
---
  def destroy
    @section = find_section
    @section.destroy

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def find_section
    Section.find(params[:id])