app/controllers/subjects_controller.rb

  def new
    #This will give default values specified in our models in our form, we can add default
    #values like name done below
    @subject = Subject.new({:name => 'Default'})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    #Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    #Save the object
    if @subject.save
    #If Save succeeds, redirect to the index action
    flash[:notice] = "Subject created successfully."
    redirect_to(subjects_path)
    else
    #If the save fails, redisplay the form so user can fix problems
    @subject_count = Subject.count + 1
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Third Subject', 3, 1, '2017-08-02 20:55:33', '2017-08-02 20:55:33')
SELECT COUNT(*) FROM `subjects`

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
    #Instantiate a new object using form parameters
    @subject = Subject.find(params[:id])
    #Save the object
    if @subject.update_attributes(subject_params)
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `created_at` = '2017-08-09 02:14:00', `updated_at` = '2017-08-07 19:42:15' WHERE `subjects`.`id` = 6

  def delete
    @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 1